{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Emmet Abbreviation": "Скорочення Emmet",
			"Enter Abbreviation": "Введіть скорочення",
			"Invalid emmet.variables field. See https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration for a valid example.": "Неприпустиме поле emmet.variables. Допустимий приклад: https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration.",
			"Invalid snippets file. See https://code.visualstudio.com/docs/editor/emmet#_using-custom-emmet-snippets for a valid example.": "Неприпустимий файл фрагментів. Допустимий приклад: https://code.visualstudio.com/docs/editor/emmet#_using-custom-emmet-snippets.",
			"Invalid syntax profile. See https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration for a valid example.": "Неприпустимий профіль синтаксису. Допустимий приклад: https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration."
		},
		"package": {
			"command.balanceIn": "Баланс (вхідний)",
			"command.balanceOut": "Баланс (вихідний)",
			"command.decrementNumberByOne": "Зменшити значення на 1",
			"command.decrementNumberByOneTenth": "Зменшити значення на 0.1",
			"command.decrementNumberByTen": "Зменшити значення на 10",
			"command.evaluateMathExpression": "Обчислити математичний вираз",
			"command.incrementNumberByOne": "Збільшити значення на 1",
			"command.incrementNumberByOneTenth": "Збільшити значення на 0.1",
			"command.incrementNumberByTen": "Збільшити значення на 10",
			"command.matchTag": "Перейти до відповідної пари",
			"command.mergeLines": "Об'єднати рядки",
			"command.nextEditPoint": "Перейти до наступної точки зміни",
			"command.prevEditPoint": "Перейти до попередньої точки зміни",
			"command.reflectCSSValue": "Відобразити CSS-значення",
			"command.removeTag": "Видалити тег",
			"command.selectNextItem": "Вибрати наступний елемент",
			"command.selectPrevItem": "Вибрати попередній елемент",
			"command.showEmmetCommands": "Показати команди Emmet",
			"command.splitJoinTag": "Розділити/об'єднати тег",
			"command.toggleComment": "Переключити коментар",
			"command.updateImageSize": "Оновити розмір зображення",
			"command.updateTag": "Оновити тег",
			"command.wrapWithAbbreviation": "Перенести зі скороченням",
			"description": "Підтримка Emmet для VS Code",
			"emmetExclude": "Масив мов, у яких не повинні розгортатися скорочення Emmet.",
			"emmetExtensionsPath": "Масив шляхів, де кожен шлях може містити Emmet syntaxProfiles та (або) файли фрагментів.\r\nУ разі конфліктів профілі або фрагменти пізніших шляхів будуть перевизначати попередні шляхи.\r\nДодаткові відомості та приклад файлу фрагмента див. на сторінці https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration.",
			"emmetExtensionsPathItem": "Шлях, що містить syntaxProfiles та (або) фрагментів Emmet.",
			"emmetIncludeLanguages": "Увімкніть скорочення Emmet у мовах, які не підтримуються за замовчуванням. Додайте сюди зіставлення між мовою та іншою мовою, що підтримується Emmet.\r\n Наприклад: {\"vue-html\": \"html\", \"javascript\": \"javascriptreact\"}.",
			"emmetOptimizeStylesheetParsing": "Якщо цей параметр має значення false, аналізується весь файл, щоб перевірити, чи можна виконати розгортання скорочень Emmet у поточній позиції. Якщо цей параметр має значення true, у файлах CSS/SCSS/Less аналізується лише вміст поруч із поточною позицією.",
			"emmetPreferences": "Налаштування, які використовуються для зміни поведінки деяких дій та співставників Emmet.",
			"emmetPreferencesAllowCompactBoolean": "Якщо цей параметр має значення true, формується компактний запис логічних атрибутів.",
			"emmetPreferencesBemElementSeparator": "Розділювач елемента для класів, що використовується з фільтром BEM.",
			"emmetPreferencesBemModifierSeparator": "Розділювач модифікатора для класів, що використовується з фільтром BEM.",
			"emmetPreferencesCssAfter": "Символ, який буде розміщено в кінці властивості CSS при розгортанні скорочень CSS.",
			"emmetPreferencesCssBetween": "Символ, який буде розміщений між властивістю CSS та значенням при розгортанні скорочень CSS.",
			"emmetPreferencesCssColorShort": "Якщо цей параметр має значення \"true\", то значення кольорів, такі як \"#f\", будуть розширені до \"#fff\" замість \"#ffffff\".",
			"emmetPreferencesCssFuzzySearchMinScore": "Мінімальна кількість очок для нечіткої відповідності скорочення (від 0 до 1). При вказівці нижчих значень можливе збільшення числа помилкових спрацьовувань, при вказівці більш високих значень - зменшення кількості можливих відповідностей.",
			"emmetPreferencesCssMozProperties": "Розділений комами список властивостей CSS, які отримують префікс розробника \"moz\" при використанні в скороченнях Emmet, які починаються з \"-\". Щоб префікс \"moz\" ніколи не підставлявся, встановіть як цей параметр порожнє значення.",
			"emmetPreferencesCssMsProperties": "Розділений комами список властивостей CSS, які отримують префікс розробника \"ms\" при використанні в скороченнях Emmet, які починаються з \"-\". Щоб префікс \"ms\" ніколи не підставлявся, встановіть як цей параметр порожнє значення.",
			"emmetPreferencesCssOProperties": "Розділений комами список властивостей CSS, які отримують префікс розробника \"o\" при використанні в скороченнях Emmet, які починаються з \"-\". Щоб префікс \"o\" ніколи не підставлявся, встановіть як цей параметр порожнє значення.",
			"emmetPreferencesCssWebkitProperties": "Розділений комами список властивостей CSS, які отримують префікс розробника \"webkit\" при використанні в скороченнях Emmet, які починаються з \"-\". Щоб префікс \"webkit\" ніколи не підставлявся, встановіть як цей параметр порожнє значення.",
			"emmetPreferencesFilterCommentAfter": "Визначення коментаря, який має бути розміщений після відповідного елемента при застосуванні фільтра коментаря.",
			"emmetPreferencesFilterCommentBefore": "Визначення коментаря, який має бути розміщений перед відповідним елементом при застосуванні фільтра коментаря.",
			"emmetPreferencesFilterCommentTrigger": "Розділений комами список імен атрибутів, які повинні бути присутніми в скороченні для застосування фільтра коментаря.",
			"emmetPreferencesFloatUnit": "Одиниця виміру за замовчуванням для значень з плаваючою комою.",
			"emmetPreferencesFormatForceIndentTags": "Масив імен тегів, для яких завжди слід використовувати внутрішні відступи.",
			"emmetPreferencesFormatNoIndentTags": "Масив імен тегів, для яких ніколи не слід використовувати внутрішні відступи.",
			"emmetPreferencesIntUnit": "Одиниця виміру за замовчуванням для цілочисельних значень.",
			"emmetPreferencesOutputInlineBreak": "Кількість однорівневих вбудованих елементів, необхідних для розміщення розривів рядків між цими елементами. Якщо задано значення 0, вбудовані елементи завжди розширюються на один рядок.",
			"emmetPreferencesOutputReverseAttributes": "Якщо цей параметр має значення \"true\", то при розширенні фрагментів коду напрямок злиття атрибутів змінюється на зворотний.",
			"emmetPreferencesOutputSelfClosingStyle": "Стиль самозакриваючих тегів: HTML (\"<br>\"), XML (\"<br/>\") або XHTML (\"<br />\").",
			"emmetPreferencesSassAfter": "Символ, який буде розміщений в кінці властивості CSS при розгортанні скорочень CSS у файлах Sass.",
			"emmetPreferencesSassBetween": "Символ, який буде розміщений між властивістю CSS та значенням при розгортанні скорочень CSS у файлах Sass.",
			"emmetPreferencesStylusAfter": "Символ, який буде розміщений в кінці властивості CSS при розгортанні скорочень CSS у файлах Stylus.",
			"emmetPreferencesStylusBetween": "Символ, який буде розміщений між властивістю CSS та значенням при розгортанні скорочень CSS у файлах Stylus.",
			"emmetShowAbbreviationSuggestions": "Відображає можливі скорочення Emmet у вигляді пропозицій. Не застосовується в таблицях стилів або якщо параметр emmet.showExpandedAbbreviation має значення \"never\".",
			"emmetShowExpandedAbbreviation": "Показує розгорнуті скорочення Emmet у вигляді пропозицій.\r\nПараметр inMarkupAndStylesheetFilesOnly застосовується до html, haml, jade, slim, xml, xsl, css, scss, sass, less та stylus.\r\nПараметр always застосовується до всіх частин файлу, незалежно від розмітки чи CSS.",
			"emmetShowSuggestionsAsSnippets": "Якщо цей параметр має значення true, пропозиції Emmet будуть відображатися у вигляді фрагментів, які можна впорядкувати за допомогою параметра \"#editor.snippetSuggestions#\".",
			"emmetSyntaxProfiles": "Задайте профіль для вказаного синтаксису або використовуйте власний профіль із визначеними правилами.",
			"emmetTriggerExpansionOnTab": "Якщо цей параметр увімкнено, скорочення Emmet розгортаються при натисканні клавіші TAB, навіть якщо завершення не відображаються. Якщо цей параметр вимкнено, можна приймати відображені завершення, натискаючи клавішу TAB.",
			"emmetUseInlineCompletions": "Якщо значення дорівнює \"true\", Emmet буде використовувати вбудовані завершення для пропозиції розширень. Щоб постачальник елементів завершення, відмінний від вбудованого, відображався так часто, як цей параметр має значення \"true\", увімкніть \"#editor.quickSuggestions#\" у \"inline\" або \"off\" для елемента \"other\".",
			"emmetVariables": "Змінні, які будуть використовуватися у фрагментах Emmet."
		}
	}
}
