{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "Приклад",
			"Files by Extension": "Файли за розширенням",
			"Files with Extension": "Файли з розширенням",
			"Files with Multiple Extensions": "Файли з кількома розширеннями",
			"Files with Path": "Файли зі шляхом",
			"Files with Siblings by Name": "Файли з елементами того ж рівня за іменем",
			"Folder by Name (Any Location)": "Папка за іменем (будь-яке розташування)",
			"Folder by Name (Top Level)": "Папка за іменем (верхній рівень)",
			"Folders with Multiple Names (Top Level)": "Папки з кількома іменами (верхній рівень)",
			"GitHub": "GitHub",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Зіставити всі файли, які відповідають шаблону абсолютного шляху, з мовою з вказаним ідентифікатором.",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Зіставити всі файли, які відповідають шаблону в імені файлу, з мовою з вказаним ідентифікатором.",
			"Match a folder with a specific name in any location.": "Зіставити папку з певним іменем у будь-якому розташуванні.",
			"Match a top level folder with a specific name.": "Зіставити папку верхнього рівня з певним іменем.",
			"Match all files of a specific file extension.": "Зіставити всі файли з певним розширенням.",
			"Match all files with any of the file extensions.": "Зіставити всі файли з будь-яким із розширень файлів.",
			"Match files that have siblings with the same name but a different extension.": "Зіставити файли з елементами того ж рівня з тим самим іменем, але різними розширеннями.",
			"Match multiple top level folders.": "Зіставити кілька папок верхнього рівня.",
			"The character used by the operating system to separate components in file paths. Is also aliased to '/'.": "Символ, який використовується операційною системою для розділення компонентів у шляхах до файлів. Також використовується як '/'.",
			"The current opened file": "Поточний відкритий файл",
			"The current opened file relative to ${workspaceFolder}": "Поточний відкритий файл відносно ${workspaceFolder}",
			"The current opened file workspace folder name without any slashes (/)": "Ім’я папки робочої області поточного відкритого файлу без косої риски (/)",
			"The current opened file's basename": "Базове ім’я поточного відкритого файлу",
			"The current opened file's basename with no file extension": "Базове ім’я поточного відкритого файлу без розширення",
			"The current opened file's dirname": "Ім’я директорії поточного відкритого файлу",
			"The current opened file's dirname relative to ${workspaceFolder}": "Ім’я каталогу поточного відкритого файлу відносно ${workspaceFolder}",
			"The current opened file's extension": "Розширення поточного відкритого файлу",
			"The current selected line number in the active file": "Номер поточної вибраної строки в активному файлі",
			"The current selected text in the active file": "Поточний виділений текст в активному файлі",
			"The file extension of the editor (e.g. txt)": "Розширення файлу редактора (наприклад, txt)",
			"The file name of the editor without its directory or extension (e.g. myFile)": "Ім’я файлу редактора без його каталогу або розширення (наприклад, myFile)",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "Ім’я задачі збірки за замовчуванням. Якщо задачі збірки за замовчуванням відсутні, відображається меню швидкого вибору для вибору задачі збірки.",
			"The name of the folder opened in VS Code without any slashes (/)": "Ім’я папки, відкритої в VS Code, без косих рисок (/)",
			"The nth parent folder name of the editor": "Ім’я n-ої батьківської папки редактора",
			"The parent folder name of the editor (e.g. myFileFolder)": "Ім’я батьківської папки редактора (наприклад, myFileFolder)",
			"The path of the folder opened in VS Code": "Шлях до папки, відкритої в VS Code",
			"The path where an extension is installed.": "Шлях, за яким встановлено розширення.",
			"The task runner's current working directory on startup": "Поточний робочий каталог засобу запуску задачі при запуску",
			"Use the language of the currently active text editor if any": "Використовувати мову активного текстового редактора, якщо така є",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "умовний роздільник (-), який відображається, лише якщо оточений змінними зі значеннями",
			"an indicator for when the active editor has unsaved changes": "показує, коли в активному редакторі є незбережені зміни",
			"e.g. SSH": "наприклад, SSH",
			"e.g. VS Code": "наприклад, VS Code",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "шлях до робочої області (наприклад, /Users/Development/myWorkspace)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "шлях до папки робочої області, в якій міститься файл (наприклад, /Users/Development/myFolder)",
			"gist": "gist",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "ім’я папки робочої області, в якій міститься файл (наприклад, myFolder)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "ім’я робочої області з необов’язковою віддаленою назвою та індикатором робочої області, якщо це застосовно (наприклад, myFolder, myRemoteFolder [SSH] або myWorkspace (робоча область))",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "скорочена назва робочої області без суфіксів (наприклад, myFolder або myWorkspace)",
			"the file name (e.g. myFile.txt)": "ім’я файлу (наприклад, myFile.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "повний шлях до файлу (наприклад, /Users/Development/myFolder/myFileFolder/myFile.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "повний шлях до папки, де знаходиться файл (наприклад, /Users/Development/myFolder/myFileFolder)",
			"the name of the active branch in the active repository (e.g. main)": "ім’я активної гілки в активному репозиторії (наприклад, main)",
			"the name of the active repository (e.g. vscode)": "ім’я активного репозиторію (наприклад, vscode)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "ім’я папки, де знаходиться файл (наприклад, myFileFolder)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "шлях до файлу відносно папки робочої області (наприклад, myFolder/myFileFolder/myFile.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "шлях до папки, де знаходиться файл, відносно папки робочої області (наприклад, myFolder/myFileFolder)"
		},
		"package": {
			"description": "Надає можливості (такі як IntelliSense та автоматичне виправлення) для конфігураційних файлів, таких як файли параметрів, файли запуску та файли рекомендацій для розширень.",
			"displayName": "Зміна конфігурації"
		}
	}
}
