{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "URL-адреси даних не є допустимим джерелом зображень.",
			"Embedded SVGs are not a valid image source.": "Вбудовані файли SVG не є допустимим джерелом зображень.",
			"Error parsing the when-clause:": "Помилка під час аналізу умови when:",
			"Images must use the HTTPS protocol.": "Зображення повинні використовувати протокол HTTPS.",
			"Language specific editor settings": "Параметри редактора, що визначаються мовою",
			"Override editor settings for language": "Перевизначити параметри редактора для мови",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Для використання відносних URL-адрес емблем необхідно вказати у файлі package.json репозиторій, доступ до якого здійснюється за протоколом HTTPS.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Для використання відносних URL-адрес зображень необхідно вказати у файлі package.json репозиторій, доступ до якого здійснюється за протоколом HTTPS.",
			"Remove activation event": "Видалити подію активації",
			"SVGs are not a valid image source.": "Файли SVG не є допустимим джерелом зображень.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "Цю подію активації можна видалити, оскільки VS Code створює їх автоматично з оголошень внеску у package.json.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "Цю подію активації можна видалити для розширень, призначених для версії рушія ^1.75, оскільки VS Code автоматично створить їх з ваших оголошень про внески у package.json.",
			"This activation event cannot be explicitly listed by your extension.": "Цю подію активації не можна явно перераховувати у вашому розширенні.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Цю пропозицію неможливо використовувати, оскільки продукт визначає для цього розширення фіксований набір пропозицій API. Ви можете протестувати розширення, але перед публікацією необхідно зв'язатися з командою VS Code.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "Не варто використовувати активацію \"*\", оскільки це впливає на продуктивність."
		},
		"package": {
			"description": "Надає функції жанрів для розробки розширень.",
			"displayName": "Розробка розширення"
		}
	}
}
